In [1]:
import numpy as np
import matplotlib.pyplot as plt 
import pandas as pd

In [205]:
data = pd.read_csv("train.csv")

In [207]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
#let's clean the data

In [209]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [211]:
data = data.drop(columns =["Ticket","Name","Cabin"])

In [213]:
data.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0            1         0       3    male  22.0      1      0   7.2500        S
1            2         1       1  female  38.0      1      0  71.2833        C
2            3         1       3  female  26.0      0      0   7.9250        S
3            4         1       1  female  35.0      1      0  53.1000        S
4            5         0       3    male  35.0      0      0   8.0500        S

In [ ]:
#let's convert the strings varaible into integers

In [215]:
data = pd.get_dummies(data , columns=["Sex","Embarked"] , drop_first=True)

In [247]:
data["Sex_male"] = data["Sex_male"].astype(int)
data["Embarked_Q"] = data["Embarked_Q"].astype(int)
data["Embarked_S"] = data["Embarked_S"].astype(int)

In [249]:
data.head()

,PassengerId,Pclass,Age,SibSp,Parch,Fare,Sex_male,Embarked_Q,Embarked_S
0,1,3,22.0,1,0,7.2500,1,0,1
1,2,1,38.0,1,0,71.2833,0,0,0
2,3,3,26.0,0,0,7.9250,0,0,1
3,4,1,35.0,1,0,53.1000,0,0,1
4,5,3,35.0,0,0,8.0500,1,0,1

In [251]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 714 entries, 0 to 890
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  714 non-null    int64
 1   Pclass       714 non-null    int64
 2   Age          714 non-null    float64
 3   SibSp        714 non-null    int64
 4   Parch        714 non-null    int64
 5   Fare         714 non-null    float64
 6   Sex_male     714 non-null    int32
 7   Embarked_Q   714 non-null    int32
 8   Embarked_S   714 non-null    int32
dtypes: float64(2), int32(3), int64(4)
memory usage: 47.4 KB

In [ ]:
#let's drop the NaN values

In [253]:
data = data.dropna(subset = "Age")
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 714 entries, 0 to 890
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  714 non-null    int64
 1   Pclass       714 non-null    int64
 2   Age          714 non-null    float64
 3   SibSp        714 non-null    int64
 4   Parch        714 non-null    int64
 5   Fare         714 non-null    float64
 6   Sex_male     714 non-null    int32
 7   Embarked_Q   714 non-null    int32
 8   Embarked_S   714 non-null    int32
dtypes: float64(2), int32(3), int64(4)
memory usage: 47.4 KB

In [255]:
y = data["Survived"]
y.info()

KeyError: 'Survived'

In [225]:
y = y.dropna()

In [227]:
data = data.drop(columns=["Survived"])

In [257]:
data.head()

,PassengerId,Pclass,Age,SibSp,Parch,Fare,Sex_male,Embarked_Q,Embarked_S
0,1,3,22.0,1,0,7.2500,1,0,1
1,2,1,38.0,1,0,71.2833,0,0,0
2,3,3,26.0,0,0,7.9250,0,0,1
3,4,1,35.0,1,0,53.1000,0,0,1
4,5,3,35.0,0,0,8.0500,1,0,1

In [ ]:
#Now let's normalize the data

In [259]:
X = data

In [261]:
X.head()

,PassengerId,Pclass,Age,SibSp,Parch,Fare,Sex_male,Embarked_Q,Embarked_S
0,1,3,22.0,1,0,7.2500,1,0,1
1,2,1,38.0,1,0,71.2833,0,0,0
2,3,3,26.0,0,0,7.9250,0,0,1
3,4,1,35.0,1,0,53.1000,0,0,1
4,5,3,35.0,0,0,8.0500,1,0,1

In [267]:
X.info()

<class 'pandas.core.frame.DataFrame'>
Index: 714 entries, 0 to 890
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  714 non-null    float64
 1   Pclass       714 non-null    float64
 2   Age          714 non-null    float64
 3   SibSp        714 non-null    float64
 4   Parch        714 non-null    float64
 5   Fare         714 non-null    float64
 6   Sex_male     714 non-null    float64
 7   Embarked_Q   714 non-null    float64
 8   Embarked_S   714 non-null    float64
dtypes: float64(9)
memory usage: 55.8 KB

In [263]:
X = ( X - X.min() ) / ( X.max() - X.min() )

In [265]:
X.head()

,PassengerId,Pclass,Age,SibSp,Parch,Fare,Sex_male,Embarked_Q,Embarked_S
0,0.000000,1.0,0.271174,0.2,0.0,0.014151,1.0,0.0,1.0
1,0.001124,0.0,0.472229,0.2,0.0,0.139136,0.0,0.0,0.0
2,0.002247,1.0,0.321438,0.0,0.0,0.015469,0.0,0.0,1.0
3,0.003371,0.0,0.434531,0.2,0.0,0.103644,0.0,0.0,1.0
4,0.004494,1.0,0.434531,0.0,0.0,0.015713,1.0,0.0,1.0

In [269]:
X.info()

<class 'pandas.core.frame.DataFrame'>
Index: 714 entries, 0 to 890
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  714 non-null    float64
 1   Pclass       714 non-null    float64
 2   Age          714 non-null    float64
 3   SibSp        714 non-null    float64
 4   Parch        714 non-null    float64
 5   Fare         714 non-null    float64
 6   Sex_male     714 non-null    float64
 7   Embarked_Q   714 non-null    float64
 8   Embarked_S   714 non-null    float64
dtypes: float64(9)
memory usage: 55.8 KB

In [271]:
y.head

<bound method NDFrame.head of 0      0
1      1
2      1
3      1
4      0
      ..
885    0
886    0
887    1
889    1
890    0
Name: Survived, Length: 714, dtype: int64>

In [277]:
from sklearn.model_selection import train_test_split

In [273]:
X.shape

(714, 9)

In [275]:
y.shape

(714,)

In [279]:
X_train,X_test,y_train,y_test = train_test_split(X , y , test_size = 0.3 ,random_state = 42)

In [281]:
X_train

,PassengerId,Pclass,Age,SibSp,Parch,Fare,Sex_male,Embarked_Q,Embarked_S
37,0.041573,1.0,0.258608,0.0,0.000000,0.015713,1.0,0.0,1.0
58,0.065169,0.5,0.057552,0.2,0.333333,0.054164,0.0,0.0,1.0
57,0.064045,1.0,0.352852,0.0,0.000000,0.014110,1.0,0.0,0.0
94,0.105618,1.0,0.736115,0.0,0.000000,0.014151,1.0,0.0,1.0
209,0.234831,0.0,0.497361,0.0,0.000000,0.060508,1.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...
92,0.103371,0.0,0.572757,0.2,0.000000,0.119406,1.0,0.0,1.0
134,0.150562,0.5,0.308872,0.0,0.000000,0.025374,1.0,0.0,1.0
337,0.378652,0.0,0.509927,0.0,0.000000,0.262527,0.0,0.0,0.0
548,0.615730,1.0,0.409399,0.2,0.166667,0.040062,1.0,0.0,1.0
130,0.146067,1.0,0.409399,0.0,0.000000,0.015412,1.0,0.0,0.0

In [283]:
def sigmoid(z):
    return 1 / ( 1 + np.exp(-z))

In [285]:
def log_likelihood(w,b,X,y):
    z = np.dot(w,X.T) + b
    y_pred = sigmoid(z)

    log_likelihood = -np.sum(y * np.log(y_pred) + (1 - y) * np.log(1 - y_pred))/len(y)
    return log_likelihood

In [287]:
def gradient_descent(w,b,X,y,learning_rate):
    
        z = np.dot(w,X.T)+b
        y_pred = sigmoid(z)
        
        dw = np.dot(X.T,(y_pred-y)) / len(y)
        db = np.sum(y_pred-y) / len(y)

        w = w - learning_rate * dw
        b = b - learning_rate * db
        return w,b

In [289]:
def logistic_regression(X,y,learning_rate,iteration):
    w = np.zeros(X.shape[1])
    b = 0

    for i in range(iteration):
        w,b = gradient_descent(w,b,X,y,learning_rate)
        
        loss = log_likelihood(w,b,X,y)

    return w,b

In [291]:
learning_rate = 0.05
iteration = 1000

w,b = logistic_regression(X_train,y_train,learning_rate,iteration)

print('weight:',w)
print('bias:',b)

weight: [ 0.49687528 -1.08745282 -0.09023698  0.01845142  0.06897624  0.33738008
 -2.01092237  0.0290624  -0.08966887]
bias: 1.2044068935688304

In [293]:
#testing
z = np.dot(w,X_test.T) + b
sigmoid_test = sigmoid(z)

In [295]:
y_test.iloc[189]

0

In [297]:
y_train.iloc[189]

1

In [299]:
predicted_value = 0
for i in range(y_test.size):
    if sigmoid_test[i] >= 0.5 and y_test.iloc[i] == 1:
        predicted_value += 1
    elif sigmoid_test[i] < 0.5 and y_test.iloc[i] == 0:
        predicted_value += 1
print(f"there is {predicted_value} over {y_test.size}")
accuracy = (predicted_value/y_test.size)*100
print(f"the model has {accuracy:.2f} % accuracy")

there is 162 over 215
the model has 75.35 % accuracy